---
kind: other
id: Methods.T:Autodesk.Revit.UI.Macros.DocumentEntryPoint
source: html/12abc9d9-11e3-1959-9c70-f4f587f5972e.htm
---
# DocumentEntryPoint Methods

Verifies that the user can be prompted to place the input element type interactively.